Revit 2027 API
BuiltInFailures.JoinElementsFailures.CannotJoinRoofError Property
 The roof cannot be joined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotJoinRoofError { get; }
Public Shared ReadOnly Property CannotJoinRoofError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotJoinRoofError {
	FailureDefinitionId^ get ();
}
static member CannotJoinRoofError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace